pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2353.h
/* No control bits available or already defined for another module */

/*****************************************************************************
 TB2 Registers
*****************************************************************************/

#define __MSP430_HAS_TB2__ 3                  /* Definition to show that module is available */
#ifndef __MSP430_HAS_TBx__
#define __MSP430_HAS_TBx__
#endif
#define __MSP430_BASEADDRESS_TB2__ 0x0400
#define TB2_BASE               __MSP430_BASEADDRESS_TB2__

sfr_w(TB2CTL);                                /* Timer_B Control Register */
sfr_b(TB2CTL_L);
sfr_b(TB2CTL_H);
sfr_w(TB2CCTL0);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB2CCTL0_L);
sfr_b(TB2CCTL0_H);
sfr_w(TB2CCTL1);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB2CCTL1_L);
sfr_b(TB2CCTL1_H);
sfr_w(TB2CCTL2);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB2CCTL2_L);
sfr_b(TB2CCTL2_H);
sfr_w(TB2R);                                  /* Timer_B count register */
sfr_b(TB2R_L);
sfr_b(TB2R_H);
sfr_w(TB2CCR0);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB2CCR0_L);
sfr_b(TB2CCR0_H);
sfr_w(TB2CCR1);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB2CCR1_L);
sfr_b(TB2CCR1_H);
sfr_w(TB2CCR2);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB2CCR2_L);
sfr_b(TB2CCR2_H);
sfr_w(TB2EX0);                                /* Timer_Bx Expansion Register 0 */
sfr_b(TB2EX0_L);
sfr_b(TB2EX0_H);
sfr_w(TB2IV);                                 /* Timer_Bx Interrupt Vector Register */
sfr_b(TB2IV_L);
sfr_b(TB2IV_H);

/* TB2 Register Offsets */
#define OFS_TB2CTL                       (0x0000)
#define OFS_TB2CTL_L                     OFS_TB2CTL
#define OFS_TB2CTL_H                     OFS_TB2CTL+1
#define OFS_TB2CCTL0                     (0x0002)
#define OFS_TB2CCTL0_L                   OFS_TB2CCTL0
#define OFS_TB2CCTL0_H                   OFS_TB2CCTL0+1
#define OFS_TB2CCTL1                     (0x0004)
#define OFS_TB2CCTL1_L                   OFS_TB2CCTL1
#define OFS_TB2CCTL1_H                   OFS_TB2CCTL1+1
#define OFS_TB2CCTL2                     (0x0006)
#define OFS_TB2CCTL2_L                   OFS_TB2CCTL2
#define OFS_TB2CCTL2_H                   OFS_TB2CCTL2+1
#define OFS_TB2R                         (0x0010)
#define OFS_TB2R_L                       OFS_TB2R
#define OFS_TB2R_H                       OFS_TB2R+1
#define OFS_TB2CCR0                      (0x0012)
#define OFS_TB2CCR0_L                    OFS_TB2CCR0
#define OFS_TB2CCR0_H                    OFS_TB2CCR0+1
#define OFS_TB2CCR1                      (0x0014)
#define OFS_TB2CCR1_L                    OFS_TB2CCR1
#define OFS_TB2CCR1_H                    OFS_TB2CCR1+1
#define OFS_TB2CCR2                      (0x0016)
#define OFS_TB2CCR2_L                    OFS_TB2CCR2
#define OFS_TB2CCR2_H                    OFS_TB2CCR2+1
#define OFS_TB2EX0                       (0x0020)
#define OFS_TB2EX0_L                     OFS_TB2EX0
#define OFS_TB2EX0_H                     OFS_TB2EX0+1
#define OFS_TB2IV                        (0x002E)
#define OFS_TB2IV_L                      OFS_TB2IV
#define OFS_TB2IV_H                      OFS_TB2IV+1

/* No control bits available or already defined for another module */

/*****************************************************************************
 TB3 Registers
*****************************************************************************/

#define __MSP430_HAS_TB3__ 7                  /* Definition to show that module is available */
#ifndef __MSP430_HAS_TBx__
#define __MSP430_HAS_TBx__
#endif
#define __MSP430_BASEADDRESS_TB3__ 0x0440
#define TB3_BASE               __MSP430_BASEADDRESS_TB3__

sfr_w(TB3CTL);                                /* Timer_B Control Register */
sfr_b(TB3CTL_L);
sfr_b(TB3CTL_H);
sfr_w(TB3CCTL0);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB3CCTL0_L);
sfr_b(TB3CCTL0_H);
sfr_w(TB3CCTL1);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB3CCTL1_L);
sfr_b(TB3CCTL1_H);
sfr_w(TB3CCTL2);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB3CCTL2_L);
sfr_b(TB3CCTL2_H);
sfr_w(TB3CCTL3);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB3CCTL3_L);
sfr_b(TB3CCTL3_H);
sfr_w(TB3CCTL4);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB3CCTL4_L);
sfr_b(TB3CCTL4_H);
sfr_w(TB3CCTL5);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB3CCTL5_L);
sfr_b(TB3CCTL5_H);
sfr_w(TB3CCTL6);                              /* Timer_B Capture/Compare Control Register */
sfr_b(TB3CCTL6_L);
sfr_b(TB3CCTL6_H);
sfr_w(TB3R);                                  /* Timer_B count register */
sfr_b(TB3R_L);
sfr_b(TB3R_H);
sfr_w(TB3CCR0);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB3CCR0_L);
sfr_b(TB3CCR0_H);
sfr_w(TB3CCR1);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB3CCR1_L);
sfr_b(TB3CCR1_H);
sfr_w(TB3CCR2);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB3CCR2_L);
sfr_b(TB3CCR2_H);
sfr_w(TB3CCR3);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB3CCR3_L);
sfr_b(TB3CCR3_H);
sfr_w(TB3CCR4);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB3CCR4_L);
sfr_b(TB3CCR4_H);
sfr_w(TB3CCR5);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB3CCR5_L);
sfr_b(TB3CCR5_H);
sfr_w(TB3CCR6);                               /* Timer_B Capture/Compare  Register */
sfr_b(TB3CCR6_L);
sfr_b(TB3CCR6_H);
sfr_w(TB3EX0);                                /* Timer_Bx Expansion Register 0 */
sfr_b(TB3EX0_L);
sfr_b(TB3EX0_H);
sfr_w(TB3IV);                                 /* Timer_Bx Interrupt Vector Register */
sfr_b(TB3IV_L);
sfr_b(TB3IV_H);

/* TB3 Register Offsets */
#define OFS_TB3CTL                       (0x0000)
#define OFS_TB3CTL_L                     OFS_TB3CTL
#define OFS_TB3CTL_H                     OFS_TB3CTL+1
#define OFS_TB3CCTL0                     (0x0002)
#define OFS_TB3CCTL0_L                   OFS_TB3CCTL0
#define OFS_TB3CCTL0_H                   OFS_TB3CCTL0+1
#define OFS_TB3CCTL1                     (0x0004)
#define OFS_TB3CCTL1_L                   OFS_TB3CCTL1
#define OFS_TB3CCTL1_H                   OFS_TB3CCTL1+1
#define OFS_TB3CCTL2                     (0x0006)
#define OFS_TB3CCTL2_L                   OFS_TB3CCTL2
#define OFS_TB3CCTL2_H                   OFS_TB3CCTL2+1
#define OFS_TB3CCTL3                     (0x0008)
#define OFS_TB3CCTL3_L                   OFS_TB3CCTL3
#define OFS_TB3CCTL3_H                   OFS_TB3CCTL3+1
#define OFS_TB3CCTL4                     (0x000A)
#define OFS_TB3CCTL4_L                   OFS_TB3CCTL4
#define OFS_TB3CCTL4_H                   OFS_TB3CCTL4+1
#define OFS_TB3CCTL5                     (0x000C)
#define OFS_TB3CCTL5_L                   OFS_TB3CCTL5
#define OFS_TB3CCTL5_H                   OFS_TB3CCTL5+1
#define OFS_TB3CCTL6                     (0x000E)
#define OFS_TB3CCTL6_L                   OFS_TB3CCTL6
#define OFS_TB3CCTL6_H                   OFS_TB3CCTL6+1
#define OFS_TB3R                         (0x0010)
#define OFS_TB3R_L                       OFS_TB3R
#define OFS_TB3R_H                       OFS_TB3R+1
#define OFS_TB3CCR0                      (0x0012)
#define OFS_TB3CCR0_L                    OFS_TB3CCR0
#define OFS_TB3CCR0_H                    OFS_TB3CCR0+1
#define OFS_TB3CCR1                      (0x0014)
#define OFS_TB3CCR1_L                    OFS_TB3CCR1
#define OFS_TB3CCR1_H                    OFS_TB3CCR1+1
#define OFS_TB3CCR2                      (0x0016)
#define OFS_TB3CCR2_L                    OFS_TB3CCR2
#define OFS_TB3CCR2_H                    OFS_TB3CCR2+1
#define OFS_TB3CCR3                      (0x0018)
#define OFS_TB3CCR3_L                    OFS_TB3CCR3
#define OFS_TB3CCR3_H                    OFS_TB3CCR3+1
#define OFS_TB3CCR4                      (0x001A)
#define OFS_TB3CCR4_L                    OFS_TB3CCR4
#define OFS_TB3CCR4_H                    OFS_TB3CCR4+1
#define OFS_TB3CCR5                      (0x001C)
#define OFS_TB3CCR5_L                    OFS_TB3CCR5
#define OFS_TB3CCR5_H                    OFS_TB3CCR5+1
#define OFS_TB3CCR6                      (0x001E)
#define OFS_TB3CCR6_L                    OFS_TB3CCR6
#define OFS_TB3CCR6_H                    OFS_TB3CCR6+1
#define OFS_TB3EX0                       (0x0020)
#define OFS_TB3EX0_L                     OFS_TB3EX0
#define OFS_TB3EX0_H                     OFS_TB3EX0+1
#define OFS_TB3IV                        (0x002E)
#define OFS_TB3IV_L                      OFS_TB3IV
#define OFS_TB3IV_H                      OFS_TB3IV+1

